# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, MobileNetv3, [24, 1]],# 0-P3/8 80 *160
   [-1, 1, MobileNetv3, [48, 2]], # 1-P3/8 40 *80
   [-1, 1, MobileNetv3, [576, 3]],  # 2-P4/16 40*40
  ]

# YOLOv5 head
head:
  [[-1, 3, C3, [512, False]],  # 13
   [-1, 1, CBAM, [512]],
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-1, 1, CBAM, [512]],
   [[-1, 1], 1, BiFPN_Concat2, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-1, 1, CBAM, [256]],
   [[-1, 0], 1, BiFPN_Concat2, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [-1, 1, CBAM, [256]],
   [[-1, 10, 1], 1, BiFPN_Concat3, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [-1, 1, CBAM, [512]],
   [[-1, 5], 1, BiFPN_Concat2, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[14, 18, 22], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]