# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 6  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [5,8, 8,9, 7,14]
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, MobileNetv3, [24, 1]],# 0-P3/8 160 *160
   [-1, 1, MobileNetv3, [40, 2]], # 1-P3/8 80 *80
   [-1, 1, MobileNetv3, [112, 3]],  # 2-P4/16 40*40
   [-1, 1, MobileNetv3, [960, 4]], # 3-7-P5/32 20*20,
   [-1, 1, CBAM, [288]],
   [-1, 3, C3, [1024, False]],
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]], #4 20*20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #40 *40
   [[-1, 2], 1, Concat, [1]],  # cat backbone P1  #40 *40
   [-1, 3, C3, [512, False]],  # 15,6,7

   [-1, 1, Conv, [256, 1, 1]], #40 *40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #80 *80
   [[-1, 1], 1, Concat, [1]],  # cat backbone P0 #80 *80
   [-1, 3, C3, [256, False]],  # 19,11 (P3/8-small)  #80 *80

   [-1, 1, Conv, [256, 1, 1]], #80 *80
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #160 *160
   [[-1, 0], 1, Concat, [1]],  # cat backbone P0 #160 *160
   [-1, 3, C3, [128, False]],  # 15 (P3/8-small)  #160 *160

   [-1, 1, Conv, [256, 3, 2]], #80 *80
   [[-1, 14], 1, Concat, [1]],  # cat head P1  #80 *80
   [-1, 3, C3, [256, False]],  # 22,18 (P4/16-medium)  #80 *80

   [-1, 1, Conv, [256, 3, 2]], #40 *40
   [[-1, 10], 1, Concat, [1]],  # cat head P1  #40 *40
   [-1, 3, C3, [256, False]],  # 21 (P4/16-medium)  #40 *40

   [-1, 1, Conv, [512, 3, 2]], #20 *20
   [[-1, 3], 1, Concat, [1]],  # cat head P2,  20 *20
   [-1, 4, C3, [1024, False]],  # 24 (P5/32-large) #20 *20

   [[17, 20, 23, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]